
&ИзменениеИКонтроль("УточнитьМинимальнуюВерсиюПлатформыИзСервиса")
Процедура OTUS_УточнитьМинимальнуюВерсиюПлатформыИзСервиса(ОбщиеПараметры)

	Если Не ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПолучениеОбновленийПрограммы") Тогда
		Возврат;
	КонецЕсли;

	// Проверка версии БИП начиная с которой появился программный интерфейс
	МодульИнтернетПоддержкаПользователейКлиентСервер = ОбщийМодуль("ИнтернетПоддержкаПользователейКлиентСервер");
	ВерсияБИП = МодульИнтернетПоддержкаПользователейКлиентСервер.ВерсияБиблиотеки();

	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияБИП, "2.7.1.35") <= 0 Тогда
		Возврат;
	КонецЕсли;

	Попытка
		МодульПолучениеОбновленийПрограммы = ОбщийМодуль("ПолучениеОбновленийПрограммы");
		ИнформацияОВерсияхПлатформы        = МодульПолучениеОбновленийПрограммы.ИнформацияОВерсияхПлатформы();

		// Контроль заполнения версий платформы по данным сервиса
		Если ПустаяСтрока(ИнформацияОВерсияхПлатформы.МинимальнаяВерсияПлатформы)
			И ПустаяСтрока(ИнформацияОВерсияхПлатформы.РекомендуемаяВерсияПлатформы) Тогда
			Возврат;
		КонецЕсли;

		Минимальная   = НомерСборкиПоТекущейВерсииПлатформы(ИнформацияОВерсияхПлатформы.МинимальнаяВерсияПлатформы);
		Рекомендуемая = НомерСборкиПоТекущейВерсииПлатформы(ИнформацияОВерсияхПлатформы.РекомендуемаяВерсияПлатформы);

		Если МинимальнаяИРекомендуемаяВерсияПлатформыЗаполненаНеПравильно(Минимальная, Рекомендуемая) Тогда

			МодульПолучениеОбновленийПрограммы.УдалитьИнформациюОВерсияхПлатформы();
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Минимальная и рекомендуемая версии платформы ""1С:Предприятие"", полученные с сервиса обновления приложений, не соответствуют следующим требованиям:
			| - минимальная версия должна быть заполнена;
			| - минимальная версия не должна быть меньше минимальной версии БСП (см. %1);
			| - минимальная версия не должна быть меньше рекомендуемой версии.
			|Минимальная версия сервиса обновления приложений: %2
			|Минимальная версия БСП: %3
			|Рекомендуемая версия сервиса обновления приложений: %4
			|
			|Минимальная и рекомендуемая версия платформы ""1С:Предприятие"" установлена по данным см. %5.
			|Минимальная версия: %6
			|Рекомендуемая версия: %7'",
			КодОсновногоЯзыка()),
			"ОбщегоНазначения.МинимальнаяВерсияПлатформы", Минимальная, НомерСборкиПоТекущейВерсииПлатформы(МинимальнаяВерсияПлатформы()),
			Рекомендуемая, "ОбщегоНазначенияПереопределяемый.ПриОпределенииОбщихПараметровБазовойФункциональности",
			ОбщиеПараметры.МинимальнаяВерсияПлатформы, ОбщиеПараметры.РекомендуемаяВерсияПлатформы);
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Базовая функциональность'", КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Предупреждение,,, 
			ТекстСообщения);
			Возврат;
		КонецЕсли;

		ОбщиеПараметры.МинимальнаяВерсияПлатформы   = Минимальная;
		ОбщиеПараметры.РекомендуемаяВерсияПлатформы = Рекомендуемая;

	Исключение
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось изменить минимальную и рекомендуемую версию платформы ""1С:Предприятие"", полученную с сервиса обновления приложений, по причине:
		|%1'",
		КодОсновногоЯзыка()), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Базовая функциональность'", КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Предупреждение,,,
		ТекстСообщения);
	КонецПопытки;

КонецПроцедуры
